ClientTest/Xml/FlighPriceRq2.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header />
  <S:Body>
    <FlightPriceRQ xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="16.1" PrimaryLangID="EN" xmlns="http://www.iata.org/IATA/EDIST">
      <Document>
        <Name>BA</Name>
      </Document>
      <Party>
        <Sender>
          <TravelAgencySender>
            <Contacts>
              <Contact>
                <EmailContact>
                  <Address>ndc@ba.com</Address>
                </EmailContact>
              </Contact>
            </Contacts>
            <IATA_Number>91210092</IATA_Number>
            <AgencyID>BATEST</AgencyID>
          </TravelAgencySender>
        </Sender>
        <Participants>
          <Participant>
            <AggregatorParticipant SequenceNumber="1">
              <Name>go4travel</Name>
              <AggregatorID>00089751</AggregatorID>
            </AggregatorParticipant>
          </Participant>
        </Participants>
      </Party>
      <Travelers>
        <Traveler>
          <AnonymousTraveler>
            <PTC>ADT</PTC>
            <Age>
              <BirthDate>1988-06-07</BirthDate>
            </Age>
          </AnonymousTraveler>
        </Traveler>
        <Traveler>
          <AnonymousTraveler>
            <PTC>CHD</PTC>
            <Age>
              <BirthDate>2013-06-07</BirthDate>
            </Age>
          </AnonymousTraveler>
        </Traveler>
      </Travelers>
      <Query>
        <OriginDestination>
          <Flight>
            <Departure>
              <AirportCode>LHR</AirportCode>
              <Date>2018-06-26</Date>
              <Time>08:45</Time>
            </Departure>
            <Arrival>
              <AirportCode>DME</AirportCode>
              <Date>2018-06-26</Date>
            </Arrival>
            <MarketingCarrier>
              <AirlineID>BA</AirlineID>
              <FlightNumber>0233</FlightNumber>
            </MarketingCarrier>
            <ClassOfService refs="FBCODE1ADT">
              <Code>N</Code>
            </ClassOfService>
          </Flight>
        </OriginDestination>
        <OriginDestination>
          <Flight>
            <Departure>
              <AirportCode>DME</AirportCode>
              <Date>2018-06-29</Date>
              <Time>16:05</Time>
            </Departure>
            <Arrival>
              <AirportCode>LHR</AirportCode>
              <Date>2018-06-29</Date>
            </Arrival>
            <MarketingCarrier>
              <AirlineID>BA</AirlineID>
              <FlightNumber>0232</FlightNumber>
            </MarketingCarrier>
            <ClassOfService refs="FBCODE2ADT">
              <Code>K</Code>
            </ClassOfService>
          </Flight>
        </OriginDestination>
      </Query>
      <Preference>
        <FarePreferences>
          <Types>
            <Type>
              <Code>759</Code>
            </Type>
          </Types>
        </FarePreferences>
      </Preference>
      <DataLists>
        <FareList>
          <FareGroup ListKey="FBCODE1ADT">
            <Fare>
              <FareCode>
                <Code>70J</Code>
              </FareCode>
            </Fare>
            <FareBasisCode>
              <Code>NHNC00S7/Y</Code>
            </FareBasisCode>
          </FareGroup>
          <FareGroup ListKey="FBCODE2ADT">
            <Fare>
              <FareCode>
                <Code>70J</Code>
              </FareCode>
            </Fare>
            <FareBasisCode>
              <Code>KHNC00S7/Y</Code>
            </FareBasisCode>
          </FareGroup>
        </FareList>
      </DataLists>
    </FlightPriceRQ>
  </S:Body>
</S:Envelope>